{
    "siteTitle": "Jesse Leung - Software Engineer",
    "changeLanguage": "日本語",
    "year": "2022",
    "firstName": "jesse",
    "lastName": "leung",
    "job": "swe",
    "location": "tokyo",
    "github": "projects",
    "resume": "resume",
    "aboutMe": "about",
    "email": "email",
    "aboutTitle": "About",
    "aboutContent": [
        "My name is Jesse Leung.  I'm a Chinese American software engineer based out of Tokyo, Japan.  In my career I've designed and contributed to the core systems of numerous large scale projects including matchmaking websites and iOS games.  ",
        "I also love coding and enjoy building projects during my free time.  I'm currently learning both Rust and Python and using them to build a locality sensitive hashing algorithm and an automated art generator based on current events.  ",
        "Outside of work, I love cycling, cooking, and playing with my poodle, Seulgi.  I'm always looking for new opportunities to grow as a software engineer.  If you have a code-y, math-y (or Rust based) project in mind, please reach out!"
    ],
    "resumePage": {
        "summary": "A deeply driven software engineer seeking to learn from experienced mentors, contribute to growing projects, and assume greater leadership responsibility within my team.",
        "experience": {
            "title": "experience",
            "jobTitle": "software engineer",
            "companyName": "steins inc.",
            "date": "dec 2020 - present",
            "techStackTitle": "tech stack:",
            "projects": {
                "title": "selected projects",
                "descriptions": [
                    {
                        "title": "rhythm game (concept, prototype)",
                        "bullets": [
                            "Expertly designing and implementing input system, event manager, and score manager to calculate and broadcast information about score, tap timing, and other core game functionality.",
                            "Diligently designing and building the song layout functionality to visually represent a song’s Json data.",
                            "Carefully dapting a Midi to Json converter which translated song files from the audio team into game-usable data."
                        ],
                        "techStack": "C#, Unity, UniRX, DOTween, .Net"
                    }
                ]
            }
        },
        "education": "education",
        "technicalSkills": "technical skills",
        "personalProjects": "personal projects"
    }
}